app/controllers/events_controller.rb

SELECT "events".* FROM "events"
---
  def index
    render json: Event.all