app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
      current_user = User.find(session[:user_id])

INSERT INTO "users" ("first_name", "last_name", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["first_name", "Not"], ["last_name", "Maggie"], ["created_at", "2022-04-20 15:49:31.305861"], ["updated_at", "2022-04-20 15:49:31.305861"]]
---
    def create
      user = User.create!(user_params)